# Zsh
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# unix utils
brew 'nmap'
brew 'unrar'
brew 'wget'

# ruby
brew 'rbenv'
brew 'ruby-build'

# build
brew 'coreutils'

# ansible
brew 'ansible'
brew 'fig'

# things
brew 'node'
brew 'npm'
brew 'packer'
brew 'redis'

# casks
brew 'caskroom/cask/brew-cask'
brew 'brew-cask'

# apps
cask 'gulp'
cask 'google-chrome'
cask '1password'
cask 'iterm2'
cask 'sourcetree'
cask 'eclipse-jee'
cask 'mamp'
cask 'evernote'
cask 'moom'
cask 'sequel-pro'
cask 'tunnelblick'
cask 'skype'
cask 'virtualbox'
cask 'vagrant'
cask 'hipchat'
cask 'adobe-creative-cloud'
cask 'kindle'
cask 'sts'
cask 'mongohub'

tap 'caskroom/homebrew-versions'
cask 'sublime-text3'
cask 'firefox-de'

# install fonts
tap 'caskroom/homebrew-fonts'
cask 'font-hack'
cask 'font-abel'
cask 'font-aclonica'

# Dev Tools
brew 'mongodb'
brew 'groovy'
brew 'grails'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'

# XSITE Tools
cask 'java'
brew 'maven'
brew 'elasticsearch'
brew 'typesafe-activator'


