# Zsh
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# unix utils
brew 'htop-osx'
brew 'docker'
brew 'nmap'
brew 'unrar'
brew 'watch'
brew 'wget'
brew 'md5sha1sum'
cask 'ngrep'

# ruby
brew 'rbenv'
brew 'ruby-build'

# build
brew 'coreutils'

# ansible
brew 'ansible'
brew 'fig'

# bin
brew 'node'
brew 'npm'
brew 'packer'

# casks
brew 'caskroom/cask/brew-cask'
brew 'brew-cask'

# apps
cask 'google-chrome'
cask '1password'
cask 'iterm2'

# install from appstore
cask 'sequel-pro'
cask 'skype'
cask 'virtualbox'
cask 'vagrant'
cask 'hipchat'
cask 'java'

# install fonts
tap 'caskroom/fonts'
cask 'font-inconsolata-dz-for-powerline'

#XSITE Tools
brew 'elasticsearch'
